//*****************************************************************
// 文件名 :						Point3D.h
// 版本	 :						1.0
// 目的及主要功能 :				空间点
// 创建日期 :					2019.11.1
// 修改日期 :					
// 作者 :						Fiki
// 修改者 :						
// 联系方式 :					fiki@seu.edu.cn
//*****************************************************************/
#pragma once


/*****************************************************************
Project Files Included
*****************************************************************/



/*****************************************************************
Defines
*****************************************************************/
#ifdef SURGICALPLAN_EXPORT
#define SURGICALPLAN_API __declspec(dllexport)
#else
#define SURGICALPLAN_API __declspec(dllimport)
#endif


/*****************************************************************
						Routine Definitions
*****************************************************************/

namespace SURGICALPLAN
{
	//空间点类
	class SURGICALPLAN_API Point3D
	{
	public:
		Point3D();
		virtual ~Point3D();

	public:
		int X;		//空间坐标
		int Y;
		int Z;
	};

}